In [55]:
import pandas as pd
data = {'Name': ['Sakthi','Siva','Murugan'], 'Age':[21,25,1], 'city': ['MDU',None,'DPI'],'ph':[7,1,None]}
df = pd.DataFrame(data)
print(df)

      Name  Age  city   ph
0   Sakthi   21   MDU  7.0
1     Siva   25  None  1.0
2  Murugan    1   DPI  NaN

In [5]:
df.head()

      Name  Age city
0   Sakthi   21  MDU
1     Siva   25  CBE
2  Murugan    1  DPI

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [9]:
df.describe()

             Age
count   3.000000
mean   15.666667
std    12.858201
min     1.000000
25%    11.000000
50%    21.000000
75%    23.000000
max    25.000000

In [15]:
df['Name']

0     Sakthi
1       Siva
2    Murugan
Name: Name, dtype: object

In [17]:
df[df['Age']>21]

   Name  Age city
1  Siva   25  CBE

In [19]:
df.sort_values(by='Age')

      Name  Age city
2  Murugan    1  DPI
0   Sakthi   21  MDU
1     Siva   25  CBE

In [51]:
df.dropna()

     Name  Age city   ph
0  Sakthi   21  MDU  7.0

In [63]:
df.fillna(0)

      Name  Age city   ph
0   Sakthi   21  MDU  7.0
1     Siva   25    0  1.0
2  Murugan    1  DPI  0.0

In [67]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>